spirit0908/STM32/main.c
/*******************************************************************************
 * Function Name  : SerialInit
 * Description    : Initializes the serial link.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void SerialInit(void)
{
	USART_InitTypeDef USART_InitStruct;

	/* *** USART1 *** */
	/* Enable USART1 clock */
	RCC_APB1PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE);

	/* Enable USART  */
	USART_StructInit(&USART_InitStruct);
	USART_Cmd(USART1, DISABLE);
	USART_Init(USART1, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
	USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART1, USART_IT_TC, DISABLE);


	/* *** USART2 *** */
	/* Enable USART2 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	/* Enable USART  */
	USART_StructInit(&USART_InitStruct);
	USART_Cmd(USART2, ENABLE);
	USART_Init(USART2, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART2, USART_IT_TC, DISABLE);


	/* *** USART3 *** */
	/* Enable USART3 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

	/* Enable USART  */
	/* Teleinfo EDF */
	USART_InitStruct.USART_BaudRate 	= 0x04B0; /* 1200 Baud */
	USART_InitStruct.USART_WordLength 	= USART_WordLength_8b;
	USART_InitStruct.USART_StopBits 	= USART_StopBits_1;
	USART_InitStruct.USART_Parity 		= USART_Parity_Even;
	USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStruct.USART_Mode			= USART_Mode_Rx; 	/* Only Rx pin is configured */
	USART_InitStruct.USART_Clock 		= USART_Clock_Disable;
	USART_InitStruct.USART_CPOL 		= USART_CPOL_Low;
	USART_InitStruct.USART_CPHA 		= USART_CPHA_1Edge;
	USART_InitStruct.USART_LastBit 		= USART_LastBit_Disable;

	USART_Cmd(USART3, ENABLE);
	USART_Init(USART3, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
	USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART3, USART_IT_TC, DISABLE);
}

/*******************************************************************************
 * Function Name  : CanInit
 * Description    : Initializes the CAN controller module.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void CanInit(void)
{
	CAN_InitTypeDef CAN_InitStruct;

	/* Enable CAN clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap1_CAN, DISABLE);
	GPIO_PinRemapConfig(GPIO_Remap2_CAN, DISABLE);

	/* Enable USART  */
	CAN_StructInit(&CAN_InitStruct);
//	CAN_Cmd(CAN, ENABLE);
	CAN_Init(&CAN_InitStruct);

	//Configure CAN
	CAN_StructInit(&CAN_InitStruct);

	/* CAN cell init */
	CAN_InitStruct.CAN_TTCM = DISABLE;
	CAN_InitStruct.CAN_ABOM = DISABLE;
	CAN_InitStruct.CAN_AWUM = DISABLE;
	CAN_InitStruct.CAN_NART = DISABLE;
	CAN_InitStruct.CAN_RFLM = DISABLE;
	CAN_InitStruct.CAN_TXFP = DISABLE;
	CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;

//	/* CAN Baudrate = 250kbps */
//	/* not working */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//	CAN_InitStruct.CAN_Prescaler = 4;
//
//	/* CAN Baudrate = 500kbps */
	/* not working */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_2tq;
//	CAN_InitStruct.CAN_Prescaler = 1;


#if (CAN_BAUDRATE == CAN_BAUDRATE_10KBPS)
	/* Not tested */
	//	/* CAN Baudrate = 10kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 400;
#elif CAN_BAUDRATE == CAN_BAUDRATE_20KBPS
	//	/* CAN Baudrate = 20kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 200;
#elif CAN_BAUDRATE == CAN_BAUDRATE_50KBPS
	//	/* CAN Baudrate = 50kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 80;
#elif CAN_BAUDRATE == CAN_BAUDRATE_100KBPS
	//	/* CAN Baudrate = 100kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 40;
#elif CAN_BAUDRATE == 125
	//	/* CAN Baudrate = 125kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 32;
#elif CAN_BAUDRATE == CAN_BAUDRATE_250KBPS
	//	/* CAN Baudrate = 250kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 16;
#elif CAN_BAUDRATE == CAN_BAUDRATE_500KBPS
	//	/* CAN Baudrate = 500kbps */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//	CAN_InitStruct.CAN_Prescaler = 8;

	/* CAN Baudrate = 500kbps */
	/* or: system clock = 72MHz (PCLK1 = 36 MHz) */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_8tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_3tq;
	CAN_InitStruct.CAN_Prescaler = 6;
#elif CAN_BAUDRATE == CAN_BAUDRATE_1MPBS
	/* CAN Baudrate = 1MBps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 4;
#endif

	CAN_Init(&CAN_InitStruct);

	  /* CAN filter init */
//	#ifdef  __CAN1_USED__
	  CAN_FilterInitStructure.CAN_FilterNumber = 0;
//	#else /*__CAN2_USED__*/
//	  CAN_FilterInitStructure.CAN_FilterNumber = 14;
//	#endif  /* __CAN1_USED__ */
	  CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	  CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	  CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0100 << 5;
	  CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
	  CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0700 << 5;
	  CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
	  CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	  CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	  CAN_FilterInit(&CAN_FilterInitStructure);

//	CAN_Init(&CAN_InitStruct);

	/* Enable IT on USART handler */
	CAN_ITConfig(CAN_IT_RQCP0, ENABLE);
	CAN_ITConfig(CAN_IT_FMP0, ENABLE);


	CAN_ITConfig(CAN_IT_RQCP1, ENABLE);	/* Request completed mailbox 1 */
	CAN_ITConfig(CAN_IT_RQCP2, ENABLE);	/* Request completed mailbox 2 */
	CAN_ITConfig(CAN_IT_TME, ENABLE);	/* Transmit mailbox empty */
	CAN_ITConfig(CAN_IT_FMP0, ENABLE);	/* FIFO 0 message pending */
	CAN_ITConfig(CAN_IT_FF0, ENABLE);	/* FIFO 0 full */
	CAN_ITConfig(CAN_IT_FOV0, ENABLE);	/* FIFO 0 overrun */
	CAN_ITConfig(CAN_IT_FMP1, ENABLE);	/* FIFO 1 message pending */
	CAN_ITConfig(CAN_IT_FF1, ENABLE);	/* FIFO 1 full */
	CAN_ITConfig(CAN_IT_FOV1, ENABLE);	/* FIFO 1 overrun */
}
//void CAN_Config(void)
//{
//  GPIO_InitTypeDef  GPIO_InitStructure;
//
//  /* GPIO clock enable */
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//  RCC_APB2PeriphClockCmd(RCC_APB1Periph_CAN);
////#ifdef  __CAN1_USED__
////  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_CAN1, ENABLE);
////#else /*__CAN2_USED__*/
////  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_CAN, ENABLE);
////#endif  /* __CAN1_USED__ */
//  /* Configure CAN pin: RX */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_RX;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
//  GPIO_Init(GPIO_CAN, &GPIO_InitStructure);
//
//  /* Configure CAN pin: TX */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_TX;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_Init(GPIO_CAN, &GPIO_InitStructure);
//
// GPIO_PinRemapConfig(GPIO_Remapping_CAN , DISABLE);
//
//  /* CANx Periph clock enable */
//#ifdef  __CAN1_USED__
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
//#else /*__CAN2_USED__*/
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN2, ENABLE);
//#endif  /* __CAN1_USED__ */
//
//
//  /* CAN register init */
//  CAN_DeInit(CANx);
//  CAN_StructInit(&CAN_InitStructure);
//
//  /* CAN cell init */
//  CAN_InitStructure.CAN_TTCM = DISABLE;
//  CAN_InitStructure.CAN_ABOM = DISABLE;
//  CAN_InitStructure.CAN_AWUM = DISABLE;
//  CAN_InitStructure.CAN_NART = DISABLE;
//  CAN_InitStructure.CAN_RFLM = DISABLE;
//  CAN_InitStructure.CAN_TXFP = DISABLE;
//  CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
//
//  /* CAN Baudrate = 1MBps*/
//  CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;
//  CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
//  CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
//  CAN_InitStructure.CAN_Prescaler = 4;
//  CAN_Init(CAN, &CAN_InitStructure);
//
//  /* CAN filter init */
//#ifdef  __CAN1_USED__
//  CAN_FilterInitStructure.CAN_FilterNumber = 0;
//#else /*__CAN2_USED__*/
//  CAN_FilterInitStructure.CAN_FilterNumber = 14;
//#endif  /* __CAN1_USED__ */
//  CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
//  CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
//  CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
//  CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
//  CAN_FilterInit(&CAN_FilterInitStructure);
//
//  /* Transmit */
//  CanTxMessage.StdId = 0x321;
//  CanTxMessage.ExtId = 0x01;
//  CanTxMessage.RTR = CAN_RTR_DATA;
//  CanTxMessage.IDE = CAN_ID_STD;
//  CanTxMessage.DLC = 1;
//}


